{
    "_links": {
        "self": {
            "href": "http:\/\/default\/trophic-levels?_format=hal_json"
        },
        "type": {
            "href": "http:\/\/drupal.org\/rest\/type\/node\/page"
        },
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json",
                "lang": "und"
            }
        ]
    },
    "uuid": [
        {
            "value": "256eb83e-f054-49d2-9f69-ec39f6fdadb6"
        }
    ],
    "langcode": [
        {
            "value": "und",
            "lang": "und"
        }
    ],
    "type": [
        {
            "target_id": "page"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2018-02-27T07:36:03+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "_embedded": {
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ]
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ],
                "lang": "und"
            }
        ]
    },
    "status": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "title": [
        {
            "value": "Trophic levels",
            "lang": "und"
        }
    ],
    "created": [
        {
            "value": "2018-02-27T07:33:54+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2018-02-27T07:36:03+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": false
        }
    ],
    "sticky": [
        {
            "value": false,
            "lang": "und"
        }
    ],
    "default_langcode": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "revision_translation_affected": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "path": [
        {
            "alias": "\/trophic-levels",
            "pid": 94,
            "langcode": "und",
            "lang": "und"
        }
    ],
    "body": [
        {
            "value": "<h1>Functions Of Ecosystem<\/h1>\r\n\r\n<ul>\r\n\t<li>The functions of an ecosystem include<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li><strong>Ecological succession or ecosystem development&nbsp;<\/strong><\/li>\r\n\t<li><strong>Homeostasis (or cybernetic) or feedback control mechanisms&nbsp;<\/strong><\/li>\r\n\t<li><strong>Energy flow through food chain [This post]<\/strong><\/li>\r\n\t<li><strong>Nutrient cycling (biogeochemical cycles) [Next post]<\/strong><\/li>\r\n<\/ol>\r\n\r\n<h1>Energy Flow Through an Ecosystem – Trophic Levels<\/h1>\r\n\r\n<p>(Trophe = Nourishment)<\/p>\r\n\r\n<ul>\r\n\t<li>The flow of energy from producer to top consumers is called energy flow which is&nbsp;<strong>unidirectional<\/strong>.<\/li>\r\n\t<li>To understand the energy flow through the ecosystem we need to study about the trophic levels [tropical level interaction].<\/li>\r\n\t<li>Trophic level is the representation of energy flow in an ecosystem. The&nbsp;trophic level&nbsp;of an organism is the position it occupies in a food chain.<\/li>\r\n\t<li>Trophic level interaction deals with how the members of an ecosystem are connected based on nutritional needs.<\/li>\r\n<\/ul>\r\n\r\n<table>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"2\">\r\n\t\t\t<h4>Trophic levels<\/h4>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Autotrophs<\/td>\r\n\t\t\t<td>Green plants (producers)<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Heterotrophs<\/td>\r\n\t\t\t<td>Herbivore (primary consumers)<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Heterotrophs<\/td>\r\n\t\t\t<td>Carnivores (secondary consumers)<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Heterotrophs<\/td>\r\n\t\t\t<td>Carnivore (tertiary consumers)<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Heterotrophs<\/td>\r\n\t\t\t<td>Top carnivores (Quarternary consumers)<\/td>\r\n\t\t<\/tr>\r\n\t<\/tbody>\r\n<\/table>\r\n\r\n<ul>\r\n\t<li>Energy flows through the trophic levels from producers to subsequent trophic levels is unidirectional.<\/li>\r\n\t<li>Energy level&nbsp;<strong>decreases<\/strong>&nbsp;from the first trophic level upwards due to loss of energy in the form of heat at each trophic level.<\/li>\r\n\t<li>This energy loss at each tropic level is quite significant. Hence there are usually not more than four-five trophic levels [beyond this the energy available is negligible to support an organism].<\/li>\r\n\t<li>The trophic level interaction involves three concepts namely<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li><strong>Food Chain<\/strong><\/li>\r\n\t<li><strong>Food Web<\/strong><\/li>\r\n\t<li><strong>Ecological Pyramids<\/strong><\/li>\r\n<\/ol>\r\n\r\n<h1>Food Chain<\/h1>\r\n\r\n<ul>\r\n\t<li>Transfer of food energy from green plants (producers) through a series of organisms with repeated eating and being eaten link is called a food chain. E.g. Grasses → Grasshopper → Frog → Snake → Hawk\/Eagle.<\/li>\r\n\t<li>Each step in the food chain is called trophic level. A food chain starts with producers and ends with top carnivores.<\/li>\r\n\t<li>The&nbsp;trophic level&nbsp;of an organism is the position it occupies in a food chain.<\/li>\r\n<\/ul>\r\n\r\n<h2>Types of Food Chains<\/h2>\r\n\r\n<ol>\r\n\t<li>Grazing food chain<\/li>\r\n\t<li>Detritus food chain<\/li>\r\n<\/ol>\r\n\r\n<h3>Grazing food chain<\/h3>\r\n\r\n<ul>\r\n\t<li>The consumers which start the food chain, utilizing the plant or plant part as their food, constitute the grazing food chain. This food chain begins from green plants at the base and the primary consumer is herbivore.<\/li>\r\n\t<li>For example, In terrestrial ecosystem, grass is eaten by caterpillar, which is eaten by lizard and lizard is eaten by snake.<\/li>\r\n\t<li>In Aquatic ecosystem phytoplankton (primary producers) are eaten by zoo planktons which are eaten by fishes and fishes are eaten by pelicans.<\/li>\r\n<\/ul>\r\n\r\n<p>Detritus food chain<\/p>\r\n\r\n<ul>\r\n\t<li>This type of food chain starts from dead organic matter of decaying animals and plant bodies.<\/li>\r\n\t<li>Dead organic matter or detritus feeding organisms are called&nbsp;<strong>detrivores or decomposer<\/strong>. The detrivores are eaten by predators.<\/li>\r\n\t<li>The two food chains are linked. The initial energy source for detritus food chain is the waste materials and dead organic matter from the grazing food chain.<\/li>\r\n\t<li>In an&nbsp;<strong>aquatic ecosystem, grazing food chain<\/strong>&nbsp;is the major conduit for energy flow. As against this, in a terrestrial ecosystem, a much larger fraction of energy flows through the detritus food chain than through the grazing food chain.<\/li>\r\n<\/ul>\r\n\r\n<table>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Bacterial and fungal enzymes degrade detritus into simpler inorganic substances. This process is called as&nbsp;<strong>catabolism<\/strong>.<\/li>\r\n\t\t\t\t<li>Humification and mineralization occur during decomposition in the soil.<\/li>\r\n\t\t\t\t<li><strong>Humification<\/strong>&nbsp;leads to accumulation of a dark coloured amorphous substance called humus that is highly resistant to microbial action and undergoes decomposition at an extremely slow rate.<\/li>\r\n\t\t\t\t<li>Being colloidal in nature, humus serves as a reservoir of nutrients. The humus is further degraded by some microbes and release of inorganic nutrients occur by the process known as&nbsp;<strong>mineralization<\/strong>.<\/li>\r\n\t\t\t\t<li><em>Warm and moist environment favor decomposition whereas low temperature and anaerobiosis inhibit decomposition<\/em>&nbsp;resulting in buildup of organic materials.<\/li>\r\n\t\t\t<\/ul>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t<\/tbody>\r\n<\/table>\r\n\r\n<h1>Food Web<\/h1>\r\n\r\n<ul>\r\n\t<li>Multiple interlinked food chains make a food web. Food web represents all the possible paths of energy flow in an ecosystem.<\/li>\r\n\t<li>If any of the intermediate food chain is removed, the succeeding links of the chain will be affected largely.<\/li>\r\n\t<li>The food web provides more than one alternative for food to most of the organisms in an ecosystem and therefore increases their chance of survival.<\/li>\r\n\t<li>Also food availability and preferences of food of the organisms may shift seasonally e.g. we eat watermelon in summer and peaches in the winter. Thus there are interconnected networks of feeding relationships that take the form of food webs.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h1>Biotic Interaction<\/h1>\r\n\r\n<ul>\r\n\t<li>The interaction that occurs among different individuals of the same species is called intraspecific interaction while the interaction among individuals of different species in a community is termed as interspecific interaction.<\/li>\r\n\t<li>Specific terms are applied to interspecific interactions depending upon whether the interaction is beneficial, harmful or neutral to individuals of the species.<\/li>\r\n\t<li>Some types of interactions listed by the effects they have on each partner. ‘0’ is no effect, ‘-’ is detrimental and ‘+’ is beneficial.<\/li>\r\n<\/ul>\r\n\r\n<p>Possible biological interactions between two species.<\/p>\r\n\r\n<table>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<h4>Type of interaction<\/h4>\r\n\r\n\t\t\t<p>Species&nbsp;&nbsp;&nbsp;<\/p>\r\n\t\t\t<\/td>\r\n\t\t\t<td>\r\n\t\t\t<h4>1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2<\/h4>\r\n\t\t\t<\/td>\r\n\t\t\t<td>\r\n\t\t\t<h4>Effects of interaction<\/h4>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">\r\n\t\t\t<h5>Negative Interactions<\/h5>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Amensalism<\/td>\r\n\t\t\t<td>–&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 0<\/td>\r\n\t\t\t<td>one species is inhibited while the other species is unaffected<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Predation<\/td>\r\n\t\t\t<td>+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; –<\/td>\r\n\t\t\t<td>Predator—prey relationship: one species (predator) benefits while the second species (prey) is harmed and inhibited.<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Parasitism<\/td>\r\n\t\t\t<td>+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; –<\/td>\r\n\t\t\t<td>Beneficial to one species (parasite) and harmful to the other species (host).<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Competition<\/td>\r\n\t\t\t<td>–&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;–<\/td>\r\n\t\t\t<td>Adversely affects both species<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">\r\n\t\t\t<h5>Positive Associations<\/h5>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Commensalism<\/td>\r\n\t\t\t<td>+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 0<\/td>\r\n\t\t\t<td>One species (the commensal) benefits, while the other species (the host) is neither harmed nor inhibited<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Mutualism<\/td>\r\n\t\t\t<td>+&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; +<\/td>\r\n\t\t\t<td>Interaction is favourable to both species<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">\r\n\t\t\t<h5>Neutral Interactions<\/h5>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t\t<tr>\r\n\t\t\t<td>Neutralism<\/td>\r\n\t\t\t<td>0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 0<\/td>\r\n\t\t\t<td>Neither species affects the other<\/td>\r\n\t\t<\/tr>\r\n\t<\/tbody>\r\n<\/table>\r\n\r\n<p>+ = beneficial; – = harmful, 0 = unaffected or neutral.<\/p>\r\n\r\n<h2>Amensalism<\/h2>\r\n\r\n<ul>\r\n\t<li>One species harms or restricts the other species without itself being adversely affected or harmed by the presence of the other species.<\/li>\r\n\t<li>Organisms that secrete&nbsp;<strong>antibiotics<\/strong>&nbsp;and the species that get inhibited by the antibiotics are examples of amensalism.<\/li>\r\n\t<li>For example the bread mould fungi Pencillium produce penicillin an antibiotic substance which inhibits the growth of a variety of bacteria.<\/li>\r\n\t<li>A large tree shades a small plant, retarding the growth of the small plant. The small plant has no effect on the large tree.<\/li>\r\n<\/ul>\r\n\r\n<h2>Predation<\/h2>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<ul>\r\n\t<li>Predators like leopards, tigers and cheetahs use speed, teeth and claws to hunt and kill their prey.<\/li>\r\n\t<li>They keep prey populations under control. But for predators, prey species could achieve very high population densities and cause ecosystem instability.<\/li>\r\n\t<li>When certain exotic species are introduced into a geographical area, they become invasive and start spreading fast because the invaded land does not have its natural predators.<\/li>\r\n\t<li>Predators also help in maintaining species diversity in a community, by reducing the intensity of competition among competing prey species.<\/li>\r\n\t<li>A wide variety of chemical substances that we extract from plants on a commercial scale (nicotine, caffeine, quinine, strychnine, opium, etc.,) are produced by plants actually as defences against grazers and browsers.<\/li>\r\n<\/ul>\r\n\r\n<h2>Parasitism<\/h2>\r\n\r\n<ul>\r\n\t<li>In this type of interaction, one species is harmed and the other benefits.<\/li>\r\n\t<li>Parasitism involves parasite usually a small size organism&nbsp;<strong>living in or on<\/strong>&nbsp;another living species called the host from which the parasite gets its nourishment and often shelter.<\/li>\r\n\t<li>Many organisms like animal, bacteria and viruses are parasites of plants and animals.<\/li>\r\n\t<li>Plants like&nbsp;<strong>dodder plant (Cuscuta)<\/strong>&nbsp;and&nbsp;<strong>mistletoe (Loranthus)<\/strong>&nbsp;are parasites that live on flowering plants.<\/li>\r\n\t<li>Tap worm, round worm, malarial parasite, many bacteria, fungi, and viruses are common parasites of humans.<\/li>\r\n\t<li>Parasites that feed on the external surface of the host organism are called&nbsp;<strong>ectoparasites<\/strong>. E.g. lice on humans. Many marine fish are infested with ectoparasitic&nbsp;<strong>copepods<\/strong>.<\/li>\r\n\t<li>The female mosquito is not considered a parasite, although it needs our blood for reproduction. Why? Because it doesn’t live on the host.<\/li>\r\n\t<li>In contrast,&nbsp;<strong>endoparasites<\/strong>&nbsp;are those that live inside the host body at different sites (liver, kidney, lungs, red blood cells, etc.).<\/li>\r\n\t<li><strong>Brood parasitism<\/strong>&nbsp;in birds is a fascinating example of parasitism in which the parasitic bird lays its eggs in the nest of its host. E.g. cuckoo (koel).<\/li>\r\n<\/ul>\r\n\r\n<h2>Competition<\/h2>\r\n\r\n<ul>\r\n\t<li>This is an interaction between two populations in which both species are harmed to some extent.<\/li>\r\n\t<li>Competition occurs when two populations or species, both need a vital resource that is in short supply.<\/li>\r\n\t<li>The vital resource could be food, water, shelter, nesting site, mates or space.<\/li>\r\n\t<li>Such competition can be:<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>interspecific competition-occurring between individuals of two different species occurring in a habitat and<\/li>\r\n\t<li>intraspecific competition-occurs between individuals of same species.<\/li>\r\n<\/ol>\r\n\r\n<ul>\r\n\t<li>Intraspecific competition occurs between members of the same species and so it is very intense.<\/li>\r\n<\/ul>\r\n\r\n<h2>Commensalism<\/h2>\r\n\r\n<ul>\r\n\t<li>In this relationship one of the species benefits while the other is neither harmed nor benefited.<\/li>\r\n\t<li>Some species obtain the benefit of shelter or transport from another species. For example&nbsp;<strong>sucker fish, remora<\/strong>&nbsp;often attaches to a shark by means of its sucker which is present on the top side of its head. This helps the remora get protection, a free ride as well as meal from the left over of the shark’s meal. The shark does not however get any benefit nor is it adversely affected by this association.<\/li>\r\n\t<li>Another example of commensalisms is the relationship between&nbsp;<strong>trees and epiphytic<\/strong>&nbsp;<strong>plants<\/strong>.<\/li>\r\n\t<li>Epiphytes live on the surface of other plants like ferns, mosses and orchids and use the surface of trees for support and for&nbsp;<strong>obtaining sunlight and moisture<\/strong>. The tree gets no benefit from this relationship nor are they harmed.<\/li>\r\n\t<li>Cow dung provides food and shelter to dung beetles. The beetles have no effect on the cows.<\/li>\r\n\t<li>Another example of commensalism is the interaction between&nbsp;<strong>sea anemone<\/strong>&nbsp;that has stinging tentacles and the&nbsp;<strong>clown fish<\/strong>&nbsp;that lives among them.<\/li>\r\n\t<li>The fish gets protection from predators which stay away from the stinging tentacles. The anemone does not appear to derive any benefit by hosting the clown fish.<\/li>\r\n<\/ul>\r\n\r\n<h2>Mutualism<\/h2>\r\n\r\n<ul>\r\n\t<li>This is a close association between two species in which both the species benefit. For example the&nbsp;<strong>sea anemone, a cnidarian<\/strong>&nbsp;gets attached to the shell of&nbsp;<strong>hermit crabs<\/strong>&nbsp;for benefit of transport and obtaining new food while the anemone provides camouflage and protection by means of its stinging cells to the hermit crab.<\/li>\r\n\t<li>However, some mutualisms are so intimate that the interacting species can no longer live without each other as they depend totally on each other to survive. Such close associations are called&nbsp;<strong>symbiosis (symbiosis is intense mutualism – E.g. coral and zooxanthellae)<\/strong>.<\/li>\r\n\t<li>An example of such close mutualistic association is that of&nbsp;<strong>termite and their intestinal flagellates<\/strong>. Termites can eat wood but have no enzymes to digest it. However, their intestine contains certain flagellate protists (protozoans) that have the necessary enzymes to digest the cellulose of the wood eaten by termites and convert it into sugar.<\/li>\r\n\t<li>The flagellates use some of this sugar for their own metabolism while enough is left for the termite. Both termite and flagellates cannot survive without each other.<\/li>\r\n\t<li>Another familiar example of symbiosis is seen in pollination of flowers where flowering plants are cross pollinated by the bees which benefit by getting nectar from the plants and both cannot survive without the other.<\/li>\r\n\t<li>Example: in pollination mutualisms, the pollinator gets food (pollen, nectar), and the plant has its pollen transferred to other flowers for cross-fertilization (reproduction).<\/li>\r\n\t<li>Lichens represent an intimate mutualistic relationship between a fungus and photosynthesizing algae or cyanobacteria.<\/li>\r\n\t<li>Similarly, the&nbsp;<strong>mycorrhizae<\/strong>&nbsp;are associations between&nbsp;<strong>fungi and the roots of higher plants<\/strong>. The fungi help the plant in the absorption of essential nutrients from the soil while the plant in turn provides the fungi with energy-yielding carbohydrates.<\/li>\r\n<\/ul>\r\n\r\n<h2>Neutralism<\/h2>\r\n\r\n<ul>\r\n\t<li>Neutralism describes the relationship between two species which do interact but do not affect each other.<\/li>\r\n\t<li>True neutralism is extremely unlikely and impossible to prove.<\/li>\r\n<\/ul>\r\n",
            "format": "rich_text",
            "processed": "<p>Functions Of Ecosystem<\/p>\n<ul><li>The functions of an ecosystem include<\/li>\n<\/ul><ol><li><strong>Ecological succession or ecosystem development <\/strong><\/li>\n<li><strong>Homeostasis (or cybernetic) or feedback control mechanisms <\/strong><\/li>\n<li><strong>Energy flow through food chain [This post]<\/strong><\/li>\n<li><strong>Nutrient cycling (biogeochemical cycles) [Next post]<\/strong><\/li>\n<\/ol><p>Energy Flow Through an Ecosystem – Trophic Levels<\/p>\n<p>(Trophe = Nourishment)<\/p>\n<ul><li>The flow of energy from producer to top consumers is called energy flow which is <strong>unidirectional<\/strong>.<\/li>\n<li>To understand the energy flow through the ecosystem we need to study about the trophic levels [tropical level interaction].<\/li>\n<li>Trophic level is the representation of energy flow in an ecosystem. The trophic level of an organism is the position it occupies in a food chain.<\/li>\n<li>Trophic level interaction deals with how the members of an ecosystem are connected based on nutritional needs.<\/li>\n<\/ul><p>\t\t\tTrophic levels<\/p>\n<p>\t\t\tAutotrophs<br \/>\n\t\t\tGreen plants (producers)<\/p>\n<p>\t\t\tHeterotrophs<br \/>\n\t\t\tHerbivore (primary consumers)<\/p>\n<p>\t\t\tHeterotrophs<br \/>\n\t\t\tCarnivores (secondary consumers)<\/p>\n<p>\t\t\tHeterotrophs<br \/>\n\t\t\tCarnivore (tertiary consumers)<\/p>\n<p>\t\t\tHeterotrophs<br \/>\n\t\t\tTop carnivores (Quarternary consumers)<\/p>\n<ul><li>Energy flows through the trophic levels from producers to subsequent trophic levels is unidirectional.<\/li>\n<li>Energy level <strong>decreases<\/strong> from the first trophic level upwards due to loss of energy in the form of heat at each trophic level.<\/li>\n<li>This energy loss at each tropic level is quite significant. Hence there are usually not more than four-five trophic levels [beyond this the energy available is negligible to support an organism].<\/li>\n<li>The trophic level interaction involves three concepts namely<\/li>\n<\/ul><ol><li><strong>Food Chain<\/strong><\/li>\n<li><strong>Food Web<\/strong><\/li>\n<li><strong>Ecological Pyramids<\/strong><\/li>\n<\/ol><p>Food Chain<\/p>\n<ul><li>Transfer of food energy from green plants (producers) through a series of organisms with repeated eating and being eaten link is called a food chain. E.g. Grasses → Grasshopper → Frog → Snake → Hawk\/Eagle.<\/li>\n<li>Each step in the food chain is called trophic level. A food chain starts with producers and ends with top carnivores.<\/li>\n<li>The trophic level of an organism is the position it occupies in a food chain.<\/li>\n<\/ul><p>Types of Food Chains<\/p>\n<ol><li>Grazing food chain<\/li>\n<li>Detritus food chain<\/li>\n<\/ol><p>Grazing food chain<\/p>\n<ul><li>The consumers which start the food chain, utilizing the plant or plant part as their food, constitute the grazing food chain. This food chain begins from green plants at the base and the primary consumer is herbivore.<\/li>\n<li>For example, In terrestrial ecosystem, grass is eaten by caterpillar, which is eaten by lizard and lizard is eaten by snake.<\/li>\n<li>In Aquatic ecosystem phytoplankton (primary producers) are eaten by zoo planktons which are eaten by fishes and fishes are eaten by pelicans.<\/li>\n<\/ul><p>Detritus food chain<\/p>\n<ul><li>This type of food chain starts from dead organic matter of decaying animals and plant bodies.<\/li>\n<li>Dead organic matter or detritus feeding organisms are called <strong>detrivores or decomposer<\/strong>. The detrivores are eaten by predators.<\/li>\n<li>The two food chains are linked. The initial energy source for detritus food chain is the waste materials and dead organic matter from the grazing food chain.<\/li>\n<li>In an <strong>aquatic ecosystem, grazing food chain<\/strong> is the major conduit for energy flow. As against this, in a terrestrial ecosystem, a much larger fraction of energy flows through the detritus food chain than through the grazing food chain.<\/li>\n<\/ul><ul><li>Bacterial and fungal enzymes degrade detritus into simpler inorganic substances. This process is called as <strong>catabolism<\/strong>.<\/li>\n<li>Humification and mineralization occur during decomposition in the soil.<\/li>\n<li><strong>Humification<\/strong> leads to accumulation of a dark coloured amorphous substance called humus that is highly resistant to microbial action and undergoes decomposition at an extremely slow rate.<\/li>\n<li>Being colloidal in nature, humus serves as a reservoir of nutrients. The humus is further degraded by some microbes and release of inorganic nutrients occur by the process known as <strong>mineralization<\/strong>.<\/li>\n<li><em>Warm and moist environment favor decomposition whereas low temperature and anaerobiosis inhibit decomposition<\/em> resulting in buildup of organic materials.<\/li>\n<\/ul><p>Food Web<\/p>\n<ul><li>Multiple interlinked food chains make a food web. Food web represents all the possible paths of energy flow in an ecosystem.<\/li>\n<li>If any of the intermediate food chain is removed, the succeeding links of the chain will be affected largely.<\/li>\n<li>The food web provides more than one alternative for food to most of the organisms in an ecosystem and therefore increases their chance of survival.<\/li>\n<li>Also food availability and preferences of food of the organisms may shift seasonally e.g. we eat watermelon in summer and peaches in the winter. Thus there are interconnected networks of feeding relationships that take the form of food webs.<\/li>\n<\/ul><p> <\/p>\n<p>Biotic Interaction<\/p>\n<ul><li>The interaction that occurs among different individuals of the same species is called intraspecific interaction while the interaction among individuals of different species in a community is termed as interspecific interaction.<\/li>\n<li>Specific terms are applied to interspecific interactions depending upon whether the interaction is beneficial, harmful or neutral to individuals of the species.<\/li>\n<li>Some types of interactions listed by the effects they have on each partner. ‘0’ is no effect, ‘-’ is detrimental and ‘+’ is beneficial.<\/li>\n<\/ul><p>Possible biological interactions between two species.<\/p>\n<p>\t\t\tType of interaction<\/p>\n<p>\t\t\tSpecies   <\/p>\n<p>\t\t\t1           2<\/p>\n<p>\t\t\tEffects of interaction<\/p>\n<p>\t\t\tNegative Interactions<\/p>\n<p>\t\t\tAmensalism<br \/>\n\t\t\t–             0<br \/>\n\t\t\tone species is inhibited while the other species is unaffected<\/p>\n<p>\t\t\tPredation<br \/>\n\t\t\t+             –<br \/>\n\t\t\tPredator—prey relationship: one species (predator) benefits while the second species (prey) is harmed and inhibited.<\/p>\n<p>\t\t\tParasitism<br \/>\n\t\t\t+             –<br \/>\n\t\t\tBeneficial to one species (parasite) and harmful to the other species (host).<\/p>\n<p>\t\t\tCompetition<br \/>\n\t\t\t–              –<br \/>\n\t\t\tAdversely affects both species<\/p>\n<p>\t\t\tPositive Associations<\/p>\n<p>\t\t\tCommensalism<br \/>\n\t\t\t+             0<br \/>\n\t\t\tOne species (the commensal) benefits, while the other species (the host) is neither harmed nor inhibited<\/p>\n<p>\t\t\tMutualism<br \/>\n\t\t\t+             +<br \/>\n\t\t\tInteraction is favourable to both species<\/p>\n<p>\t\t\tNeutral Interactions<\/p>\n<p>\t\t\tNeutralism<br \/>\n\t\t\t0             0<br \/>\n\t\t\tNeither species affects the other<\/p>\n<p>+ = beneficial; – = harmful, 0 = unaffected or neutral.<\/p>\n<p>Amensalism<\/p>\n<ul><li>One species harms or restricts the other species without itself being adversely affected or harmed by the presence of the other species.<\/li>\n<li>Organisms that secrete <strong>antibiotics<\/strong> and the species that get inhibited by the antibiotics are examples of amensalism.<\/li>\n<li>For example the bread mould fungi Pencillium produce penicillin an antibiotic substance which inhibits the growth of a variety of bacteria.<\/li>\n<li>A large tree shades a small plant, retarding the growth of the small plant. The small plant has no effect on the large tree.<\/li>\n<\/ul><p>Predation<\/p>\n<p> <\/p>\n<ul><li>Predators like leopards, tigers and cheetahs use speed, teeth and claws to hunt and kill their prey.<\/li>\n<li>They keep prey populations under control. But for predators, prey species could achieve very high population densities and cause ecosystem instability.<\/li>\n<li>When certain exotic species are introduced into a geographical area, they become invasive and start spreading fast because the invaded land does not have its natural predators.<\/li>\n<li>Predators also help in maintaining species diversity in a community, by reducing the intensity of competition among competing prey species.<\/li>\n<li>A wide variety of chemical substances that we extract from plants on a commercial scale (nicotine, caffeine, quinine, strychnine, opium, etc.,) are produced by plants actually as defences against grazers and browsers.<\/li>\n<\/ul><p>Parasitism<\/p>\n<ul><li>In this type of interaction, one species is harmed and the other benefits.<\/li>\n<li>Parasitism involves parasite usually a small size organism <strong>living in or on<\/strong> another living species called the host from which the parasite gets its nourishment and often shelter.<\/li>\n<li>Many organisms like animal, bacteria and viruses are parasites of plants and animals.<\/li>\n<li>Plants like <strong>dodder plant (Cuscuta)<\/strong> and <strong>mistletoe (Loranthus)<\/strong> are parasites that live on flowering plants.<\/li>\n<li>Tap worm, round worm, malarial parasite, many bacteria, fungi, and viruses are common parasites of humans.<\/li>\n<li>Parasites that feed on the external surface of the host organism are called <strong>ectoparasites<\/strong>. E.g. lice on humans. Many marine fish are infested with ectoparasitic <strong>copepods<\/strong>.<\/li>\n<li>The female mosquito is not considered a parasite, although it needs our blood for reproduction. Why? Because it doesn’t live on the host.<\/li>\n<li>In contrast, <strong>endoparasites<\/strong> are those that live inside the host body at different sites (liver, kidney, lungs, red blood cells, etc.).<\/li>\n<li><strong>Brood parasitism<\/strong> in birds is a fascinating example of parasitism in which the parasitic bird lays its eggs in the nest of its host. E.g. cuckoo (koel).<\/li>\n<\/ul><p>Competition<\/p>\n<ul><li>This is an interaction between two populations in which both species are harmed to some extent.<\/li>\n<li>Competition occurs when two populations or species, both need a vital resource that is in short supply.<\/li>\n<li>The vital resource could be food, water, shelter, nesting site, mates or space.<\/li>\n<li>Such competition can be:<\/li>\n<\/ul><ol><li>interspecific competition-occurring between individuals of two different species occurring in a habitat and<\/li>\n<li>intraspecific competition-occurs between individuals of same species.<\/li>\n<\/ol><ul><li>Intraspecific competition occurs between members of the same species and so it is very intense.<\/li>\n<\/ul><p>Commensalism<\/p>\n<ul><li>In this relationship one of the species benefits while the other is neither harmed nor benefited.<\/li>\n<li>Some species obtain the benefit of shelter or transport from another species. For example <strong>sucker fish, remora<\/strong> often attaches to a shark by means of its sucker which is present on the top side of its head. This helps the remora get protection, a free ride as well as meal from the left over of the shark’s meal. The shark does not however get any benefit nor is it adversely affected by this association.<\/li>\n<li>Another example of commensalisms is the relationship between <strong>trees and epiphytic<\/strong> <strong>plants<\/strong>.<\/li>\n<li>Epiphytes live on the surface of other plants like ferns, mosses and orchids and use the surface of trees for support and for <strong>obtaining sunlight and moisture<\/strong>. The tree gets no benefit from this relationship nor are they harmed.<\/li>\n<li>Cow dung provides food and shelter to dung beetles. The beetles have no effect on the cows.<\/li>\n<li>Another example of commensalism is the interaction between <strong>sea anemone<\/strong> that has stinging tentacles and the <strong>clown fish<\/strong> that lives among them.<\/li>\n<li>The fish gets protection from predators which stay away from the stinging tentacles. The anemone does not appear to derive any benefit by hosting the clown fish.<\/li>\n<\/ul><p>Mutualism<\/p>\n<ul><li>This is a close association between two species in which both the species benefit. For example the <strong>sea anemone, a cnidarian<\/strong> gets attached to the shell of <strong>hermit crabs<\/strong> for benefit of transport and obtaining new food while the anemone provides camouflage and protection by means of its stinging cells to the hermit crab.<\/li>\n<li>However, some mutualisms are so intimate that the interacting species can no longer live without each other as they depend totally on each other to survive. Such close associations are called <strong>symbiosis (symbiosis is intense mutualism – E.g. coral and zooxanthellae)<\/strong>.<\/li>\n<li>An example of such close mutualistic association is that of <strong>termite and their intestinal flagellates<\/strong>. Termites can eat wood but have no enzymes to digest it. However, their intestine contains certain flagellate protists (protozoans) that have the necessary enzymes to digest the cellulose of the wood eaten by termites and convert it into sugar.<\/li>\n<li>The flagellates use some of this sugar for their own metabolism while enough is left for the termite. Both termite and flagellates cannot survive without each other.<\/li>\n<li>Another familiar example of symbiosis is seen in pollination of flowers where flowering plants are cross pollinated by the bees which benefit by getting nectar from the plants and both cannot survive without the other.<\/li>\n<li>Example: in pollination mutualisms, the pollinator gets food (pollen, nectar), and the plant has its pollen transferred to other flowers for cross-fertilization (reproduction).<\/li>\n<li>Lichens represent an intimate mutualistic relationship between a fungus and photosynthesizing algae or cyanobacteria.<\/li>\n<li>Similarly, the <strong>mycorrhizae<\/strong> are associations between <strong>fungi and the roots of higher plants<\/strong>. The fungi help the plant in the absorption of essential nutrients from the soil while the plant in turn provides the fungi with energy-yielding carbohydrates.<\/li>\n<\/ul><p>Neutralism<\/p>\n<ul><li>Neutralism describes the relationship between two species which do interact but do not affect each other.<\/li>\n<li>True neutralism is extremely unlikely and impossible to prove.<\/li>\n<\/ul>",
            "summary": ""
        }
    ],
    "field_comment_node_page": [
        {
            "status": 1,
            "cid": 0,
            "last_comment_timestamp": 1519716963,
            "last_comment_name": null,
            "last_comment_uid": 1,
            "comment_count": 0,
            "lang": "und"
        }
    ]
}
