{
    "_links": {
        "self": {
            "href": "http:\/\/default\/nutrient-cycles-biogeo-chemical-cycles?_format=hal_json"
        },
        "type": {
            "href": "http:\/\/drupal.org\/rest\/type\/node\/page"
        },
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json",
                "lang": "und"
            }
        ]
    },
    "uuid": [
        {
            "value": "49caefce-12ca-4b81-aaf9-763b0e70b8cf"
        }
    ],
    "langcode": [
        {
            "value": "und",
            "lang": "und"
        }
    ],
    "type": [
        {
            "target_id": "page"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2018-04-03T08:01:59+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "_embedded": {
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ]
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ],
                "lang": "und"
            }
        ]
    },
    "status": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "title": [
        {
            "value": "Nutrient Cycles | Biogeo Chemical Cycles",
            "lang": "und"
        }
    ],
    "created": [
        {
            "value": "2018-04-03T07:58:52+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2018-04-03T08:01:59+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": false
        }
    ],
    "sticky": [
        {
            "value": false,
            "lang": "und"
        }
    ],
    "default_langcode": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "revision_translation_affected": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "path": [
        {
            "alias": "\/nutrient-cycles-biogeo-chemical-cycles",
            "pid": 139,
            "langcode": "und",
            "lang": "und"
        }
    ],
    "body": [
        {
            "value": "<h4>Functions Of An Ecosystem<\/h4>\r\n\r\n<ul>\r\n\t<li>The functions of an ecosystem include<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>Ecological succession or ecosystem development [Previous Posts]<\/li>\r\n\t<li>Homeostasis (or cybernetic) or feedback control mechanisms [Previous Posts]<\/li>\r\n\t<li>Energy flow through food chain [Previous Post]<\/li>\r\n\t<li>Nutrient cycling (biogeochemical cycles) [This post]<\/li>\r\n<\/ol>\r\n\r\n<h1>Biogeo Chemical Cycling or Nutrient Cycling<\/h1>\r\n\r\n<ul>\r\n\t<li>Energy flow and nutrient circulation are the major functions of the ecosystem. We have studied about energy flow through trophic levels in the previous posts.<\/li>\r\n\t<li>Energy is lost as heat forever in terms of the usefulness of the system. On the other hand, nutrients of food matter never get used up. They can be recycled again and again indefinitely.<\/li>\r\n\t<li>Carbon, hydrogen, oxygen, nitrogen&nbsp;and&nbsp;phosphorus&nbsp;as elements and compounds make up 97% of the mass of our bodies and are more than 95% of the mass of all living organisms.<\/li>\r\n\t<li>In addition to these, about 15 to 25 other elements are needed in some form for the survival and good health of plants and animals.<\/li>\r\n\t<li>These elements or mineral nutrients are always in circulation moving from non-living to living and then back to the non-living components of the ecosystem in a more or less circular fashion. This circular fashion is known as&nbsp;biogeochemical cycling&nbsp;(bio for living; geo for atmosphere).<\/li>\r\n\t<li>Among the most important nutrient cycles are the carbon nutrient cycle and the nitrogen nutrient cycle.<\/li>\r\n\t<li>There are many other nutrient cycles that are important in ecology, including a large number of trace mineral nutrient cycles.<\/li>\r\n<\/ul>\r\n\r\n<h1>Nutrient Cycles<\/h1>\r\n\r\n<ul>\r\n\t<li>Based on the replacement period, a nutrient cycle is referred to as Perfect or Imperfect cycle.<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>A perfect nutrient cycle is one in which nutrients are replaced as fast as they are utilized. Most&nbsp;gaseous cyclesare generally considered as perfect cycles.<\/li>\r\n\t<li>In contrast&nbsp;sedimentary cycles&nbsp;are considered relatively imperfect, as some nutrients are lost from the cycle and get locked into sediments and so become unavailable for immediate cycling.<\/li>\r\n<\/ol>\r\n\r\n<ul>\r\n\t<li>Based on the nature of the reservoir, there are two types of cycles namely-<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>Gaseous Cycle&nbsp;— where the reservoir is the&nbsp;atmosphere or the hydrosphere&nbsp;— water cycle, carbon cycle, nitrogen cycle, etc. and<\/li>\r\n\t<li>Sedimentary Cycle&nbsp;— where the reservoir is the&nbsp;earth’s crust&nbsp;[elements mostly found in earth’s crust] — phosphorous cycle, sulphur cycle, calcium cycle, magnesium cycle etc.<\/li>\r\n<\/ol>\r\n\r\n<h1>Carbon Cycle [Gaseous Cycle]<\/h1>\r\n\r\n<ul>\r\n\t<li>Carbon is a minor constituent of the atmosphere as compared to oxygen and nitrogen.<\/li>\r\n\t<li>However, without carbon dioxide life could not exist because it is vital for the production of carbohydrates through photosynthesis by plants.<\/li>\r\n\t<li>It is the element that anchors all organic substances from coal and oil to DNA (deoxyribonudeic acid: the compound that carries genetic information).<\/li>\r\n\t<li>Carbon is present in the atmosphere, mainly in the form of carbon dioxide (CO2).<\/li>\r\n\t<li>Carbon cycle involves a continuous exchange of carbon between the atmosphere and organisms.<\/li>\r\n\t<li>Carbon from the atmosphere moves to green plants by the process of&nbsp;photosynthesis, and then to animals.<\/li>\r\n\t<li>By process of&nbsp;respiration&nbsp;and&nbsp;decomposition&nbsp;of dead organic matter it returns back to atmosphere. It is usually a short term cycle.<\/li>\r\n\t<li>Some carbon also enters a long term cycle. It accumulates as un-decomposed organic matter in the peaty layers of marshy soil or as insoluble carbonates in bottom sediments of aquatic systems which take a long time to be released.<\/li>\r\n\t<li>In deep oceans such carbon can remained buried for millions of years till geological movement may lift these rocks above sea level. These rocks may be exposed to erosion, releasing their carbon dioxide, carbonates and bicarbonates into streams and rivers.<\/li>\r\n\t<li>Fossil fuels such as coals, oil and natural gas etc. are organic compounds that were buried before they could be decomposed and were subsequently transformed by time and geological processes into fossil fuels. When they are burned the carbon stored in them is released back into the atmosphere as carbon-dioxide.<\/li>\r\n<\/ul>\r\n\r\n<h1>Nitrogen Cycle [Gaseous Cycle]<\/h1>\r\n\r\n<ul>\r\n\t<li>Apart from carbon, hydrogen and oxygen, nitrogen is the most prevalent element in living organisms.<\/li>\r\n\t<li>Nitrogen is a constituent of&nbsp;amino acids, proteins, hormones, chlorophylls&nbsp;and many of the&nbsp;vitamins. [All of these explained under Biology&nbsp;<\/li>\r\n\t<li>Plants compete with microbes for the limited nitrogen that is available in soil. Thus, nitrogen is a&nbsp;limiting nutrientfor both natural and agricultural ecosystems.<\/li>\r\n\t<li>Nitrogen exists as two nitrogen atoms (N2) joined by a very strong&nbsp;triple covalent bond&nbsp;(N ≡ N).<\/li>\r\n\t<li>In nature,&nbsp;lightning&nbsp;and&nbsp;ultraviolet radiation&nbsp;provide enough energy to convert nitrogen to nitrogen oxides (NO, NO2, N2O).<\/li>\r\n\t<li>Industrial combustions, forest fires, automobile exhausts and power-generating stations are also sources of atmospheric nitrogen oxides.<\/li>\r\n<\/ul>\r\n\r\n<h2>Nitrogen Fixing – Nitrogen to Ammonia (N2&nbsp;to NH3)<\/h2>\r\n\r\n<ul>\r\n\t<li>There is an inexhaustible supply of nitrogen in the atmosphere but the elemental form cannot be used directly by most of the living organisms.<\/li>\r\n\t<li>Nitrogen needs to be ‘fixed’, that is,&nbsp;converted to ammonia, nitrites or nitrates, before it can be taken up by plants.<\/li>\r\n\t<li>Nitrogen fixation on earth is accomplished in three different ways:<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li><em>By microorganisms (bacteria and blue-green algae),<\/em><\/li>\r\n\t<li><em>By man using industrial processes (fertilizer factories) and<\/em><\/li>\r\n\t<li><em>To a limited extent by atmospheric phenomenon such as thunder and lighting.<\/em><\/li>\r\n<\/ol>\r\n\r\n<ul>\r\n\t<li>Certain microorganisms are capable of fixing atmospheric nitrogen into&nbsp;ammonia (NH3)&nbsp;and&nbsp;ammonium ions (NH4+).<\/li>\r\n<\/ul>\r\n\r\n<p><em>Ammonia&nbsp;is a molecule consisting of nitrogen and hydrogen having molecular NH3, while&nbsp;ammonium (NH4+)&nbsp;is an ion of&nbsp;ammonia that is formed by accepting hydrogen ion.<\/em><\/p>\r\n\r\n<ul>\r\n\t<li>The enzyme,&nbsp;nitrogenase&nbsp;which is capable of&nbsp;nitrogen reduction&nbsp;is present exclusively in&nbsp;prokaryotes. Such microbes are called&nbsp;N2-fixers. These include:<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>free living nitrogen fixing bacteria (non-symbiotic nitrogen fixing bacteria or nitrogen fixing soil bacteria) (e.g.&nbsp;<em>aerobic&nbsp;<\/em>Azotobacter&nbsp;and&nbsp;Beijemickia;&nbsp;<em>anaerobic&nbsp;<\/em>Clostridium&nbsp;and&nbsp;Rhodospirillum),<\/li>\r\n\t<li>symbiotic nitrogen fixing &nbsp;bacteria (e.g.&nbsp;Rhizobium) living in association with leguminous plants and non-leguminous root nodule plants and<\/li>\r\n\t<li>some cyanobacteria (major source of nitrogen fixation in oceans)(blue green algae. E.g. Nostoc, Anabaena, Spirulina etc.).<\/li>\r\n<\/ol>\r\n\r\n<p><em>Leguminous:<\/em><em>&nbsp;denoting plants of the pea family (Leguminosae), typically having seeds in pods, distinctive flowers, and root nodules containing nitrogen-fixing bacteria.<\/em><\/p>\r\n\r\n<h2>Nitrification – Ammonia to Nitrates<\/h2>\r\n\r\n<ul>\r\n\t<li>Ammonium ions can be directly taken up as a source of nitrogen by some plants.<\/li>\r\n\t<li>Others absorb&nbsp;nitrates&nbsp;which are obtained by oxidizing ammonia and ammonium ions.<\/li>\r\n\t<li>Ammonia and ammonium ions are oxidized to&nbsp;nitrites or nitrates&nbsp;by two groups of specialized bacteria.<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li>Ammonium&nbsp;ions are first oxidized to&nbsp;nitrite&nbsp;by the bacteria&nbsp;Nitrosomonas&nbsp;and\/or&nbsp;Nitrococcus.<\/li>\r\n\t<li>The nitrite is further oxidized to&nbsp;nitrate&nbsp;with the help of the bacterium&nbsp;Nitrobacter.<\/li>\r\n<\/ol>\r\n\r\n<ul>\r\n\t<li>These steps are called&nbsp;nitrification. These nitrifying bacteria are&nbsp;chemoautotrophs.<\/li>\r\n\t<li>The nitrate thus formed is absorbed by plants and is transported to the leaves.<\/li>\r\n\t<li>In leaves, it is reduced to form ammonia that finally forms the amine group of&nbsp;amino acids, which are the building blocks of proteins. These then go through higher trophic levels of the ecosystem.<\/li>\r\n<\/ul>\r\n\r\n<p><em>Nitrification is important in agricultural systems, where fertilizer is often applied as ammonia. Conversion of this ammonia to nitrate&nbsp;increases nitrogen leaching&nbsp;because nitrate is more water-soluble than ammonia.<\/em><\/p>\r\n\r\n<p><em>Nitrification also plays an important role in the removal of nitrogen from municipal wastewater. The conventional removal is&nbsp;nitrification, followed by&nbsp;denitrification<\/em>.<\/p>\r\n\r\n<h2>Ammonification – Urea, Uric Acid to Ammonia<\/h2>\r\n\r\n<ul>\r\n\t<li>Living organisms produce nitrogenous waste products such as urea and uric acid (organic nitrogen).<\/li>\r\n\t<li>These&nbsp;<em>waste products as well as dead remains of organisms are converted back into inorganic ammonia and ammonium ions by the bacteria<\/em>. This process is called ammonification.<\/li>\r\n\t<li>Some of this ammonia volatilizes and re-enters the atmosphere but most of it is converted into&nbsp;nitrate&nbsp;by soil bacteria.<\/li>\r\n<\/ul>\r\n\r\n<h2>Denitrification – Nitrate to Nitrogen<\/h2>\r\n\r\n<ul>\r\n\t<li>Nitrate present in the soil is&nbsp;reduced to nitrogen&nbsp;by the process of&nbsp;denitrification.<\/li>\r\n\t<li>In the soil as well as oceans there are special denitrifying bacteria (Pseudomonas&nbsp;and&nbsp;Thiobacillus), which convert the nitrates\/nitrites to elemental nitrogen. This nitrogen escapes into the atmosphere, thus completing the cycle.<\/li>\r\n<\/ul>\r\n\r\n<p>Step 1:&nbsp;<u>N2 Fixing<\/u>&nbsp;è Nitrogen → Ammonia or Ammonium Ions<\/p>\r\n\r\n<p>Step 2:&nbsp;<u>Nitrification<\/u>&nbsp;è Ammonia or Ammonium Ions → Nitrite → Nitrate<\/p>\r\n\r\n<p>Step 3:&nbsp;<u>Ammonification<\/u>&nbsp;è Dead Matter + Animal Waste (Urea, Uric Acid) → Ammonia or Ammonium Ions.<\/p>\r\n\r\n<p>Dead Matter + Animal Waste (Urea, Uric Acid) → Ammonia or Ammonium Ions [most of it escapes into atmosphere. Rest is Nitrified&nbsp;(Step 2) to&nbsp;nitrates]<\/p>\r\n\r\n<p>Nitrate [some of it is available for plants. Rest is Denitrified&nbsp;(Step 4)]<\/p>\r\n\r\n<p>Step 4:&nbsp;<u>Denitrification<\/u>&nbsp;è Nitrate → Nitrogen.<\/p>\r\n\r\n<ul>\r\n\t<li>The amount of Nitrogen fixed by man through industrial process has far exceeded the amount fixed by the Natural Cycle.<\/li>\r\n\t<li>As a result Nitrogen has become a pollutant which can disrupt the balance of nitrogen. It may lead to&nbsp;Acid rain, Eutrophication&nbsp;and&nbsp;Harmful Algal Blooms.<\/li>\r\n<\/ul>\r\n\r\n<p>Burning coal releases CO, CO2, sulphur dioxide and oxides of nitrogen – air pollutants.<\/p>\r\n\r\n<p>Oxides of nitrogen fall on earth as acid rain. Acidic rain is a complex mixture of nitrous, nitric, sulfurous and sulfuric acids which all combine to lower the pH.<\/p>\r\n\r\n<p>But, the question says “Which of the following adds\/add nitrogen to the&nbsp;soil?”<\/p>\r\n\r\n<ol>\r\n\t<li>Animal Waste like Urea, Uric acid and Death of vegetation add nitrogen in the form of nitrates directly into soil.<\/li>\r\n\t<li>Coal combustion ads nitrogen to atmosphere and from there it falls back to earth in the form of acid rain and acid rain adds nitrogen to soil.<\/li>\r\n<\/ol>\r\n\r\n<p>“The release of nitric oxides into the air in large quantities causes&nbsp;smog and acid rain&nbsp;that pollutes the atmosphere, soil and water and affects plants and animals. The increase in nitrogen and nitrous oxide is caused by automobiles, power plants and a wide variety of industries.<\/p>\r\n\r\n<p>As nitrous oxides filter into soil, it loses nutrients like calcium and potassium, which are essential for maintaining a balance in plant ecosystems. With the loss of these compounds, soil fertility declines. Also, soils become significantly more acidic.”<\/p>\r\n\r\n<p>“The main component of the nitrogen cycle starts with the element nitrogen in the air. Two nitrogen oxides are found in the air as a result of interactions with oxygen. Nitrogen will only react with oxygen in the presence of high temperatures and pressures found near&nbsp;lightning bolts&nbsp;and in combustion reactions in power plants or internal combustion engines. Nitric oxide, NO, and nitrogen dioxide, NO2, are formed under these conditions. Eventually nitrogen dioxide may react with water in rain to form&nbsp;nitric acid, HNO3. The nitrates thus formed may be utilized by plants as a nutrient (so, soil gets nitrogen from acid rain).”<\/p>\r\n\r\n<p>So, soil gets nitrogen from acid rain.<\/p>\r\n\r\n<p>From this, I feel Burning of coal by man adds nitrogen to soil but indirectly though acid rain.<\/p>\r\n\r\n<p>The answer depends on how you interpret the question.<\/p>\r\n\r\n<h1>Phosphorus Cycle [Sedimentary cycle]<\/h1>\r\n\r\n<ul>\r\n\t<li>Phosphorus plays a central role in aquatic ecosystems and water quality.<\/li>\r\n\t<li>Unlike carbon and nitrogen, which come primarily from the atmosphere, phosphorus occurs in large amounts as a mineral in phosphate rocks and enters the cycle from erosion and mining activities.<\/li>\r\n\t<li>This is the nutrient considered to be the main cause of excessive growth of rooted and free-floating microscopic plants (phytoplankton) in lakes [Eutrophication].<\/li>\r\n\t<li>The main storage for phosphorus is in the earth’s crust. On land phosphorus is usually found in the form of&nbsp;phosphates.<\/li>\r\n\t<li>By the process of weathering and erosion phosphates enter rivers and streams that transport them to the ocean.<\/li>\r\n\t<li>In the ocean phosphorus accumulates on continental shelves in the form of insoluble deposits.<\/li>\r\n\t<li>After millions of years, the crustal plates rise from the sea floor and expose the phosphates on land.<\/li>\r\n\t<li>After more time, weathering will release them from rock and the cycle’s geochemical phase begins again.<\/li>\r\n<\/ul>\r\n\r\n<h1>Sulphur Cycle [Sedimentary cycle]<\/h1>\r\n\r\n<ul>\r\n\t<li>The sulphur reservoir is in the soil and sediments where it is locked in organic (coal, oil and peat) and inorganic deposits (pyrite rock and sulphur rock) in the form of&nbsp;sulphates, sulphides&nbsp;and&nbsp;organic sulphur.<\/li>\r\n\t<li>It is released by weathering of rocks, erosional runoff and decomposition of organic matter and is carried to terrestrial and aquatic ecosystems in salt solution.<\/li>\r\n\t<li>The sulphur cycle is mostly sedimentary except two of its compounds –&nbsp;hydrogen sulphide&nbsp;(H2S)&nbsp;and&nbsp;sulphur dioxide (SO2)&nbsp;which add a&nbsp;gaseous component.<\/li>\r\n\t<li>Sulphur enters the atmosphere from several sources like&nbsp;volcanic eruptions, combustion&nbsp;of fossil fuels (coal, diesel etc.), from&nbsp;surface of ocean&nbsp;and from&nbsp;gases released by decomposition. Atmospheric hydrogen sulphide also gets oxidized into sulphur dioxide.<\/li>\r\n\t<li>Atmospheric sulphur dioxide is carried back to the earth after being dissolved in rainwater as weak&nbsp;sulphuric acid.<\/li>\r\n\t<li>Whatever the source, sulphur in the form of&nbsp;sulphates&nbsp;is take up by plants and incorporated through a series of metabolic processes into&nbsp;sulphur bearing amino acid&nbsp;which is incorporated in the proteins of autotroph tissues. It then passes through the grazing food chain.<\/li>\r\n\t<li>Sulphur bound in living organism is carried back to the soil, to the bottom of ponds and lakes and seas through&nbsp;excretion and decomposition&nbsp;of dead organic material.<\/li>\r\n<\/ul>\r\n",
            "format": "rich_text",
            "processed": "<p>Functions Of An Ecosystem<\/p>\n<ul><li>The functions of an ecosystem include<\/li>\n<\/ul><ol><li>Ecological succession or ecosystem development [Previous Posts]<\/li>\n<li>Homeostasis (or cybernetic) or feedback control mechanisms [Previous Posts]<\/li>\n<li>Energy flow through food chain [Previous Post]<\/li>\n<li>Nutrient cycling (biogeochemical cycles) [This post]<\/li>\n<\/ol><p>Biogeo Chemical Cycling or Nutrient Cycling<\/p>\n<ul><li>Energy flow and nutrient circulation are the major functions of the ecosystem. We have studied about energy flow through trophic levels in the previous posts.<\/li>\n<li>Energy is lost as heat forever in terms of the usefulness of the system. On the other hand, nutrients of food matter never get used up. They can be recycled again and again indefinitely.<\/li>\n<li>Carbon, hydrogen, oxygen, nitrogen and phosphorus as elements and compounds make up 97% of the mass of our bodies and are more than 95% of the mass of all living organisms.<\/li>\n<li>In addition to these, about 15 to 25 other elements are needed in some form for the survival and good health of plants and animals.<\/li>\n<li>These elements or mineral nutrients are always in circulation moving from non-living to living and then back to the non-living components of the ecosystem in a more or less circular fashion. This circular fashion is known as biogeochemical cycling (bio for living; geo for atmosphere).<\/li>\n<li>Among the most important nutrient cycles are the carbon nutrient cycle and the nitrogen nutrient cycle.<\/li>\n<li>There are many other nutrient cycles that are important in ecology, including a large number of trace mineral nutrient cycles.<\/li>\n<\/ul><p>Nutrient Cycles<\/p>\n<ul><li>Based on the replacement period, a nutrient cycle is referred to as Perfect or Imperfect cycle.<\/li>\n<\/ul><ol><li>A perfect nutrient cycle is one in which nutrients are replaced as fast as they are utilized. Most gaseous cyclesare generally considered as perfect cycles.<\/li>\n<li>In contrast sedimentary cycles are considered relatively imperfect, as some nutrients are lost from the cycle and get locked into sediments and so become unavailable for immediate cycling.<\/li>\n<\/ol><ul><li>Based on the nature of the reservoir, there are two types of cycles namely-<\/li>\n<\/ul><ol><li>Gaseous Cycle — where the reservoir is the atmosphere or the hydrosphere — water cycle, carbon cycle, nitrogen cycle, etc. and<\/li>\n<li>Sedimentary Cycle — where the reservoir is the earth’s crust [elements mostly found in earth’s crust] — phosphorous cycle, sulphur cycle, calcium cycle, magnesium cycle etc.<\/li>\n<\/ol><p>Carbon Cycle [Gaseous Cycle]<\/p>\n<ul><li>Carbon is a minor constituent of the atmosphere as compared to oxygen and nitrogen.<\/li>\n<li>However, without carbon dioxide life could not exist because it is vital for the production of carbohydrates through photosynthesis by plants.<\/li>\n<li>It is the element that anchors all organic substances from coal and oil to DNA (deoxyribonudeic acid: the compound that carries genetic information).<\/li>\n<li>Carbon is present in the atmosphere, mainly in the form of carbon dioxide (CO2).<\/li>\n<li>Carbon cycle involves a continuous exchange of carbon between the atmosphere and organisms.<\/li>\n<li>Carbon from the atmosphere moves to green plants by the process of photosynthesis, and then to animals.<\/li>\n<li>By process of respiration and decomposition of dead organic matter it returns back to atmosphere. It is usually a short term cycle.<\/li>\n<li>Some carbon also enters a long term cycle. It accumulates as un-decomposed organic matter in the peaty layers of marshy soil or as insoluble carbonates in bottom sediments of aquatic systems which take a long time to be released.<\/li>\n<li>In deep oceans such carbon can remained buried for millions of years till geological movement may lift these rocks above sea level. These rocks may be exposed to erosion, releasing their carbon dioxide, carbonates and bicarbonates into streams and rivers.<\/li>\n<li>Fossil fuels such as coals, oil and natural gas etc. are organic compounds that were buried before they could be decomposed and were subsequently transformed by time and geological processes into fossil fuels. When they are burned the carbon stored in them is released back into the atmosphere as carbon-dioxide.<\/li>\n<\/ul><p>Nitrogen Cycle [Gaseous Cycle]<\/p>\n<ul><li>Apart from carbon, hydrogen and oxygen, nitrogen is the most prevalent element in living organisms.<\/li>\n<li>Nitrogen is a constituent of amino acids, proteins, hormones, chlorophylls and many of the vitamins. [All of these explained under Biology <\/li>\n<li>Plants compete with microbes for the limited nitrogen that is available in soil. Thus, nitrogen is a limiting nutrientfor both natural and agricultural ecosystems.<\/li>\n<li>Nitrogen exists as two nitrogen atoms (N2) joined by a very strong triple covalent bond (N ≡ N).<\/li>\n<li>In nature, lightning and ultraviolet radiation provide enough energy to convert nitrogen to nitrogen oxides (NO, NO2, N2O).<\/li>\n<li>Industrial combustions, forest fires, automobile exhausts and power-generating stations are also sources of atmospheric nitrogen oxides.<\/li>\n<\/ul><p>Nitrogen Fixing – Nitrogen to Ammonia (N2 to NH3)<\/p>\n<ul><li>There is an inexhaustible supply of nitrogen in the atmosphere but the elemental form cannot be used directly by most of the living organisms.<\/li>\n<li>Nitrogen needs to be ‘fixed’, that is, converted to ammonia, nitrites or nitrates, before it can be taken up by plants.<\/li>\n<li>Nitrogen fixation on earth is accomplished in three different ways:<\/li>\n<\/ul><ol><li><em>By microorganisms (bacteria and blue-green algae),<\/em><\/li>\n<li><em>By man using industrial processes (fertilizer factories) and<\/em><\/li>\n<li><em>To a limited extent by atmospheric phenomenon such as thunder and lighting.<\/em><\/li>\n<\/ol><ul><li>Certain microorganisms are capable of fixing atmospheric nitrogen into ammonia (NH3) and ammonium ions (NH4+).<\/li>\n<\/ul><p><em>Ammonia is a molecule consisting of nitrogen and hydrogen having molecular NH3, while ammonium (NH4+) is an ion of ammonia that is formed by accepting hydrogen ion.<\/em><\/p>\n<ul><li>The enzyme, nitrogenase which is capable of nitrogen reduction is present exclusively in prokaryotes. Such microbes are called N2-fixers. These include:<\/li>\n<\/ul><ol><li>free living nitrogen fixing bacteria (non-symbiotic nitrogen fixing bacteria or nitrogen fixing soil bacteria) (e.g. <em>aerobic <\/em>Azotobacter and Beijemickia; <em>anaerobic <\/em>Clostridium and Rhodospirillum),<\/li>\n<li>symbiotic nitrogen fixing  bacteria (e.g. Rhizobium) living in association with leguminous plants and non-leguminous root nodule plants and<\/li>\n<li>some cyanobacteria (major source of nitrogen fixation in oceans)(blue green algae. E.g. Nostoc, Anabaena, Spirulina etc.).<\/li>\n<\/ol><p><em>Leguminous:<\/em><em> denoting plants of the pea family (Leguminosae), typically having seeds in pods, distinctive flowers, and root nodules containing nitrogen-fixing bacteria.<\/em><\/p>\n<p>Nitrification – Ammonia to Nitrates<\/p>\n<ul><li>Ammonium ions can be directly taken up as a source of nitrogen by some plants.<\/li>\n<li>Others absorb nitrates which are obtained by oxidizing ammonia and ammonium ions.<\/li>\n<li>Ammonia and ammonium ions are oxidized to nitrites or nitrates by two groups of specialized bacteria.<\/li>\n<\/ul><ol><li>Ammonium ions are first oxidized to nitrite by the bacteria Nitrosomonas and\/or Nitrococcus.<\/li>\n<li>The nitrite is further oxidized to nitrate with the help of the bacterium Nitrobacter.<\/li>\n<\/ol><ul><li>These steps are called nitrification. These nitrifying bacteria are chemoautotrophs.<\/li>\n<li>The nitrate thus formed is absorbed by plants and is transported to the leaves.<\/li>\n<li>In leaves, it is reduced to form ammonia that finally forms the amine group of amino acids, which are the building blocks of proteins. These then go through higher trophic levels of the ecosystem.<\/li>\n<\/ul><p><em>Nitrification is important in agricultural systems, where fertilizer is often applied as ammonia. Conversion of this ammonia to nitrate increases nitrogen leaching because nitrate is more water-soluble than ammonia.<\/em><\/p>\n<p><em>Nitrification also plays an important role in the removal of nitrogen from municipal wastewater. The conventional removal is nitrification, followed by denitrification<\/em>.<\/p>\n<p>Ammonification – Urea, Uric Acid to Ammonia<\/p>\n<ul><li>Living organisms produce nitrogenous waste products such as urea and uric acid (organic nitrogen).<\/li>\n<li>These <em>waste products as well as dead remains of organisms are converted back into inorganic ammonia and ammonium ions by the bacteria<\/em>. This process is called ammonification.<\/li>\n<li>Some of this ammonia volatilizes and re-enters the atmosphere but most of it is converted into nitrate by soil bacteria.<\/li>\n<\/ul><p>Denitrification – Nitrate to Nitrogen<\/p>\n<ul><li>Nitrate present in the soil is reduced to nitrogen by the process of denitrification.<\/li>\n<li>In the soil as well as oceans there are special denitrifying bacteria (Pseudomonas and Thiobacillus), which convert the nitrates\/nitrites to elemental nitrogen. This nitrogen escapes into the atmosphere, thus completing the cycle.<\/li>\n<\/ul><p>Step 1: N2 Fixing è Nitrogen → Ammonia or Ammonium Ions<\/p>\n<p>Step 2: Nitrification è Ammonia or Ammonium Ions → Nitrite → Nitrate<\/p>\n<p>Step 3: Ammonification è Dead Matter + Animal Waste (Urea, Uric Acid) → Ammonia or Ammonium Ions.<\/p>\n<p>Dead Matter + Animal Waste (Urea, Uric Acid) → Ammonia or Ammonium Ions [most of it escapes into atmosphere. Rest is Nitrified (Step 2) to nitrates]<\/p>\n<p>Nitrate [some of it is available for plants. Rest is Denitrified (Step 4)]<\/p>\n<p>Step 4: Denitrification è Nitrate → Nitrogen.<\/p>\n<ul><li>The amount of Nitrogen fixed by man through industrial process has far exceeded the amount fixed by the Natural Cycle.<\/li>\n<li>As a result Nitrogen has become a pollutant which can disrupt the balance of nitrogen. It may lead to Acid rain, Eutrophication and Harmful Algal Blooms.<\/li>\n<\/ul><p>Burning coal releases CO, CO2, sulphur dioxide and oxides of nitrogen – air pollutants.<\/p>\n<p>Oxides of nitrogen fall on earth as acid rain. Acidic rain is a complex mixture of nitrous, nitric, sulfurous and sulfuric acids which all combine to lower the pH.<\/p>\n<p>But, the question says “Which of the following adds\/add nitrogen to the soil?”<\/p>\n<ol><li>Animal Waste like Urea, Uric acid and Death of vegetation add nitrogen in the form of nitrates directly into soil.<\/li>\n<li>Coal combustion ads nitrogen to atmosphere and from there it falls back to earth in the form of acid rain and acid rain adds nitrogen to soil.<\/li>\n<\/ol><p>“The release of nitric oxides into the air in large quantities causes smog and acid rain that pollutes the atmosphere, soil and water and affects plants and animals. The increase in nitrogen and nitrous oxide is caused by automobiles, power plants and a wide variety of industries.<\/p>\n<p>As nitrous oxides filter into soil, it loses nutrients like calcium and potassium, which are essential for maintaining a balance in plant ecosystems. With the loss of these compounds, soil fertility declines. Also, soils become significantly more acidic.”<\/p>\n<p>“The main component of the nitrogen cycle starts with the element nitrogen in the air. Two nitrogen oxides are found in the air as a result of interactions with oxygen. Nitrogen will only react with oxygen in the presence of high temperatures and pressures found near lightning bolts and in combustion reactions in power plants or internal combustion engines. Nitric oxide, NO, and nitrogen dioxide, NO2, are formed under these conditions. Eventually nitrogen dioxide may react with water in rain to form nitric acid, HNO3. The nitrates thus formed may be utilized by plants as a nutrient (so, soil gets nitrogen from acid rain).”<\/p>\n<p>So, soil gets nitrogen from acid rain.<\/p>\n<p>From this, I feel Burning of coal by man adds nitrogen to soil but indirectly though acid rain.<\/p>\n<p>The answer depends on how you interpret the question.<\/p>\n<p>Phosphorus Cycle [Sedimentary cycle]<\/p>\n<ul><li>Phosphorus plays a central role in aquatic ecosystems and water quality.<\/li>\n<li>Unlike carbon and nitrogen, which come primarily from the atmosphere, phosphorus occurs in large amounts as a mineral in phosphate rocks and enters the cycle from erosion and mining activities.<\/li>\n<li>This is the nutrient considered to be the main cause of excessive growth of rooted and free-floating microscopic plants (phytoplankton) in lakes [Eutrophication].<\/li>\n<li>The main storage for phosphorus is in the earth’s crust. On land phosphorus is usually found in the form of phosphates.<\/li>\n<li>By the process of weathering and erosion phosphates enter rivers and streams that transport them to the ocean.<\/li>\n<li>In the ocean phosphorus accumulates on continental shelves in the form of insoluble deposits.<\/li>\n<li>After millions of years, the crustal plates rise from the sea floor and expose the phosphates on land.<\/li>\n<li>After more time, weathering will release them from rock and the cycle’s geochemical phase begins again.<\/li>\n<\/ul><p>Sulphur Cycle [Sedimentary cycle]<\/p>\n<ul><li>The sulphur reservoir is in the soil and sediments where it is locked in organic (coal, oil and peat) and inorganic deposits (pyrite rock and sulphur rock) in the form of sulphates, sulphides and organic sulphur.<\/li>\n<li>It is released by weathering of rocks, erosional runoff and decomposition of organic matter and is carried to terrestrial and aquatic ecosystems in salt solution.<\/li>\n<li>The sulphur cycle is mostly sedimentary except two of its compounds – hydrogen sulphide (H2S) and sulphur dioxide (SO2) which add a gaseous component.<\/li>\n<li>Sulphur enters the atmosphere from several sources like volcanic eruptions, combustion of fossil fuels (coal, diesel etc.), from surface of ocean and from gases released by decomposition. Atmospheric hydrogen sulphide also gets oxidized into sulphur dioxide.<\/li>\n<li>Atmospheric sulphur dioxide is carried back to the earth after being dissolved in rainwater as weak sulphuric acid.<\/li>\n<li>Whatever the source, sulphur in the form of sulphates is take up by plants and incorporated through a series of metabolic processes into sulphur bearing amino acid which is incorporated in the proteins of autotroph tissues. It then passes through the grazing food chain.<\/li>\n<li>Sulphur bound in living organism is carried back to the soil, to the bottom of ponds and lakes and seas through excretion and decomposition of dead organic material.<\/li>\n<\/ul>",
            "summary": ""
        }
    ],
    "field_comment_node_page": [
        {
            "status": 1,
            "cid": 0,
            "last_comment_timestamp": 1522742519,
            "last_comment_name": null,
            "last_comment_uid": 1,
            "comment_count": 0,
            "lang": "und"
        }
    ]
}
