{
    "_links": {
        "self": {
            "href": "http:\/\/default\/environment-2?_format=hal_json"
        },
        "type": {
            "href": "http:\/\/drupal.org\/rest\/type\/node\/page"
        },
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json",
                "lang": "und"
            }
        ]
    },
    "uuid": [
        {
            "value": "72ce70c2-1492-4d44-b070-ab278b29d6bb"
        }
    ],
    "langcode": [
        {
            "value": "und",
            "lang": "und"
        }
    ],
    "type": [
        {
            "target_id": "page"
        }
    ],
    "revision_timestamp": [
        {
            "value": "2018-12-04T13:58:06+00:00",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "_embedded": {
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/revision_uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ]
            }
        ],
        "http:\/\/drupal.org\/rest\/relation\/node\/page\/uid": [
            {
                "_links": {
                    "self": {
                        "href": "http:\/\/default\/users\/pritam-admin?_format=hal_json"
                    },
                    "type": {
                        "href": "http:\/\/drupal.org\/rest\/type\/user\/user"
                    }
                },
                "uuid": [
                    {
                        "value": "36f8070a-8da7-42e3-a2ae-dd04b9c8f478"
                    }
                ],
                "lang": "und"
            }
        ]
    },
    "status": [
        {
            "value": false,
            "lang": "und"
        }
    ],
    "title": [
        {
            "value": "Environment-2",
            "lang": "und"
        }
    ],
    "created": [
        {
            "value": "2018-02-23T09:52:09+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "changed": [
        {
            "value": "2018-12-04T13:58:06+00:00",
            "lang": "und",
            "format": "Y-m-d\\TH:i:sP"
        }
    ],
    "promote": [
        {
            "value": false
        }
    ],
    "sticky": [
        {
            "value": false,
            "lang": "und"
        }
    ],
    "default_langcode": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "revision_translation_affected": [
        {
            "value": true,
            "lang": "und"
        }
    ],
    "path": [
        {
            "alias": "\/environment-2",
            "pid": 92,
            "langcode": "und",
            "lang": "und"
        }
    ],
    "body": [
        {
            "value": "<h1>Functions Of Ecosystem<\/h1>\r\n\r\n<ul>\r\n\t<li>The function of an ecosystem include<\/li>\r\n<\/ul>\r\n\r\n<ol>\r\n\t<li><strong>Ecological succession or ecosystem development<\/strong><\/li>\r\n\t<li><strong>Homeostasis (or cybernetic) or feedback control mechanisms<\/strong><\/li>\r\n\t<li><strong>Energy flow through food chain [Next Post]<\/strong><\/li>\r\n\t<li><strong>Nutrient cycling (biogeochemical cycles) [Later Post]<\/strong><\/li>\r\n<\/ol>\r\n\r\n<p>Each will be discussed in detail in subsequent posts.<\/p>\r\n\r\n<h1>Ecological Succession<\/h1>\r\n\r\n<ul>\r\n\t<li>Biotic communities are dynamic in nature and change over a period of time. The process by which communities of plant and animal species in an area are replaced or changed into another over a period of time is known as ecological succession.<\/li>\r\n\t<li>Succession is a universal process of directional change in vegetation, on an ecological time scale.<\/li>\r\n\t<li>Succession occurs when a series of communities replace one another due to large scale destruction (natural or manmade). This process continues with one community replacing another, until a stable, mature community develops.<\/li>\r\n\t<li>Succession is a progressive series of changes which leads to the establishment of a relatively&nbsp;<strong>stable climax community<\/strong>.<\/li>\r\n<\/ul>\r\n\r\n<ul>\r\n\t<li>The first plant to colonize an area is called the&nbsp;<strong>pioneer community<\/strong>. The final stage of succession is called the&nbsp;<strong>climax community<\/strong>. The stage leading to the climax community are called&nbsp;<strong>successional stages&nbsp;<\/strong>or<strong>&nbsp;seres<\/strong>. Each transitional (temporary) community that is formed and replaced during succession is called a stage in succession or a&nbsp;<strong>seral community<\/strong>.<\/li>\r\n\t<li>Succession is characterized by the following:&nbsp;<em>increased productivity, the shift of nutrients from’ the reservoirs, increased diversity of organisms with increased niche development, and a gradual increase in the complexity of food webs<\/em>.<\/li>\r\n\t<li>Succession would occur faster in area existing in the&nbsp;<strong>middle of the large continent<\/strong>. This is because, here seeds of plants belonging to the different seres would reach much faster, establish and ultimately result in climax community.<\/li>\r\n\t<li>The terminal (final) stage of succession forms the community which is called as&nbsp;<strong>climax community<\/strong>. A climax community is stable, mature, more complex and long lasting.<\/li>\r\n\t<li>The entire sequence of communities in a given area, succeeding each other, during the course of succession is termed&nbsp;<strong>sere<\/strong>. Succession that occurs on land where moisture content is low for e.g. on bare rock is known as&nbsp;<strong>xerarch<\/strong>. Succession that takes place in a water body, like ponds or lake is called&nbsp;<strong>hydrarch<\/strong>.<\/li>\r\n<\/ul>\r\n\r\n<h2>Primary Succession<\/h2>\r\n\r\n<ul>\r\n\t<li>Primary succession takes place an over a&nbsp;<strong>bare or unoccupied areas<\/strong>&nbsp;such as rocks outcrop, newly formed&nbsp;<em>deltas and sand dunes, emerging volcano islands and lava flows as well as glacial moraines<\/em>&nbsp;(muddy area exposed by a retreating glacier) where no community has existed previously.<\/li>\r\n\t<li>In primary succession on a terrestrial site the new site is first colonized by a few hardy pioneer species that are often&nbsp;<strong>microbes, lichens and mosses<\/strong>. The pioneers over a few generations alter the habitat conditions by their growth and development.<\/li>\r\n<\/ul>\r\n\r\n<p>Lichens, which are capable of initiating ecological succession even on a bare rock, are actually a symbiotic association of&nbsp;<strong>algae and fungi.<\/strong>Fungus provides shelter, water and minerals to the algae and, in return, the alga provides food (photosynthesis).<\/p>\r\n\r\n<ul>\r\n\t<li>These new conditions may be conducive to the establishment of additional organisms that may subsequently arrive at the site. The pioneers through their death any decay leave patches of organic matter in which small animals can live.<\/li>\r\n\t<li>The organic matter produced by these pioneer species produce organic acids during decomposition that dissolve and etch the substratum releasing nutrients to the substratum. Organic debris accumulates in pockets and crevices, providing soil in which seeds can become lodged and grow.<\/li>\r\n\t<li>As the community of organisms continues to develop, it becomes more diverse and competition increases, but at the same time new niche opportunities develops.<\/li>\r\n\t<li>The pioneer species disappear as the habitat conditions change and invasion of new species progresses, leading to the replacement of the preceding community.<\/li>\r\n<\/ul>\r\n\r\n<h2>Secondary Succession<\/h2>\r\n\r\n<ul>\r\n\t<li>Secondary succession occurs when plants recognize an area in which the climax community has been disturbed.<\/li>\r\n\t<li>Secondary succession is the sequential development of biotic communities after the&nbsp;<strong>complete or partial destruction of the existing community<\/strong>.<\/li>\r\n<\/ul>\r\n\r\n<ul>\r\n\t<li>A mature or intermediate community may be destroyed by natural events such as floods, droughts, fires, or storms or by human interventions such as deforestation, agriculture, overgrazing, etc.<\/li>\r\n\t<li>This abandoned farmland is first invaded by hardy species of grasses that can survive in bare, sunbaked soil. These grasses may be soon joined by tall grasses and herbaceous plants. These dominate the ecosystem for some years along with mice, rabbits, insects and seed-eating birds.<\/li>\r\n\t<li>Eventually, some trees come up in this area, seeds of which may be brought by wind or animals. And over the years, a forest community develops. Thus an abandoned farmland over a period becomes dominated by trees and is transformed into a forest.<\/li>\r\n<\/ul>\r\n\r\n<h2>Difference Between Primary and Secondary Succession<\/h2>\r\n\r\n<ul>\r\n\t<li>Unlike in the primary succession, the secondary succession starts on a&nbsp;<strong>well-developed soil<\/strong>&nbsp;already formed at the site. Thus secondary succession is relatively&nbsp;<strong>faster<\/strong>&nbsp;as compared to primary succession which may often require hundreds of years.<\/li>\r\n<\/ul>\r\n\r\n<h2>Autogenic and Allogenic Succession<\/h2>\r\n\r\n<ul>\r\n\t<li>When succession is brought about by living inhabitants of that community itself, the process is called autogenic succession, while change brought about by outside forces is known as allogenic succession.<\/li>\r\n\t<li>Autogenic succession (caused by plants themselves) is succession driven by the biotic components of an ecosystem. In contrast, allogenic succession (caused by drought, fire, flooding etc.) is driven by the abiotic components of the ecosystem.<\/li>\r\n<\/ul>\r\n\r\n<h2>Autotrophic and Heterotrophic succession<\/h2>\r\n\r\n<ul>\r\n\t<li>Succession in which, initially the green plants are much greater in quantity is known as autotrophic succession; and the ones in which the heterotrophs are greater in quantity is known as heterotrophic succession.<\/li>\r\n<\/ul>\r\n\r\n<h2>Succession in Plants<\/h2>\r\n\r\n<ul>\r\n\t<li>Based on the nature of the habitat – whether it is water (or very wet areas) or it is on very dry areas – succession of plants is called&nbsp;<strong>hydrach or xerarch<\/strong>, respectively.<\/li>\r\n\t<li>Hydrarch succession takes place in wetter areas and the successional series progress from hydric to the mesic (intermediate) conditions.<\/li>\r\n\t<li>As against this, xerarch succession takes place in dry areas and the series progress from xeric to mesic conditions.<\/li>\r\n\t<li>Hence, both hydrarch and xerach successions lead to&nbsp;<strong>medium water conditions (mesic)<\/strong>&nbsp;– neither too dry (xeric) nor too wet (hydric). With time the xerophytic habitat gets converted into a&nbsp;<strong>Mesophytic one<\/strong>.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h2>Succession in Water<\/h2>\r\n\r\n<ul>\r\n\t<li>In primary succession in water, the pioneers are the small phytoplanktons, they are replaced with time by free-floating angiosperms, then by rooted hydrophytes, sedges, grasses and finally the trees. The climax again would be a forest. With time the water body is converted into land.<\/li>\r\n\t<li>Another important fact is to understand that all succession whether taking place in water or on land, proceeds to a similar climax community – the&nbsp;<strong>mesic<\/strong>.<\/li>\r\n<\/ul>\r\n\r\n<p>&nbsp;<\/p>\r\n\r\n<h1>Homeostasis<\/h1>\r\n\r\n<ul>\r\n\t<li>Homeostasis is the maintenance of a&nbsp;<strong>stable equilibrium<\/strong>, especially through physiological (through bodily part functions. E.g. Cooling your body through sweating) processes.<\/li>\r\n\t<li>Organisms try to maintain the constancy of its internal environment (a process called homeostasis) despite varying external environmental conditions that tend to upset its homeostasis.<\/li>\r\n\t<li>For humans, it could be achieved at home by using an air conditioner in summer and heater in winter.<\/li>\r\n\t<li>Here the person’s homeostasis is accomplished, not through physiological, but artificial means. How do other living organisms cope with the situation?<\/li>\r\n<\/ul>\r\n\r\n<h2>Regulate<\/h2>\r\n\r\n<ul>\r\n\t<li>Some organisms are able to maintain homeostasis by physiological (sometimes behavioral – migrating to tree shade) means which ensures constant body temperature, constant osmotic concentration, etc.<\/li>\r\n\t<li>All birds and mammals, and a very few lower vertebrate and invertebrate species are indeed capable of such regulation (thermoregulation and osmoregulation).<\/li>\r\n\t<li>The ‘success’ of mammals is largely due to their ability to maintain a constant body temperature and thrive whether they live in Antarctica or in the Sahara desert.<\/li>\r\n\t<li>The mechanisms used by most mammals to regulate their body temperature are similar to the ones that we humans use. We maintain a constant body temperature of 37 °C<\/li>\r\n\t<li>In summer, when outside temperature is more than our body temperature, we sweat profusely. The resulting evaporative cooling brings down the body temperature. In winter when the temperature is much lower than 37 °C, we start to shiver, a kind of exercise which produces heat and raises the body temperature.<\/li>\r\n\t<li>Plants, on the other hand, do not have such mechanisms to maintain internal temperatures.<\/li>\r\n<\/ul>\r\n\r\n<h2>Conform<\/h2>\r\n\r\n<ul>\r\n\t<li>An overwhelming majority (99 per cent) of animals and nearly all plants cannot maintain a constant internal environment. Their body temperature changes with the ambient temperature.<\/li>\r\n\t<li>In aquatic animals, the osmotic concentration of the body fluids change with that of the ambient water osmotic concentration. These animals and plants are simply&nbsp;<strong>conformers<\/strong>.<\/li>\r\n\t<li>Considering the benefits of a constant internal environment to the organism, we must ask why these conformers had not evolved to become regulators.<\/li>\r\n\t<li>Thermoregulation is energetically expensive for many organisms. This is particularly true for small animals like shrews and humming birds.<\/li>\r\n\t<li>Heat loss or heat gain is a function of surface area. Since small animals have a larger surface area relative to their volume, they tend to lose body heat very fast when it is cold outside; then they have to expend much energy to generate body heat [lot of food goes into heat generation] through metabolism. This is the main reason why very small animals are rarely found in polar regions.<\/li>\r\n\t<li>During the course of evolution, the costs and benefits of maintaining a constant internal environment are taken into consideration.<\/li>\r\n\t<li>Some species have evolved the ability to regulate, but only over a limited range of environmental conditions, beyond which they simply conform.<\/li>\r\n\t<li>If the stressful external conditions are localised or remain only for a short duration, the organism has two other alternatives.<\/li>\r\n<\/ul>\r\n\r\n<h2>Migrate<\/h2>\r\n\r\n<ul>\r\n\t<li>The organism can move away temporarily from the stressful habitat to a more hospitable area and return when stressful period is over<\/li>\r\n\t<li>Every winter the famous Keolado National Park (Bhartpur) in Rajasthan host thousands of migratory birds coming from Siberia and other extremely cold northern regions.<\/li>\r\n<\/ul>\r\n\r\n<h2>Suspend<\/h2>\r\n\r\n<ul>\r\n\t<li>In bacteria, fungi and lower plants, various kinds of thick-walled spores are formed which help them to survive unfavorable conditions – these germinate on availability of suitable environment.<\/li>\r\n\t<li>In higher plants, seeds and some other vegetative reproductive structures serve as means to tide over periods of stress besides helping in dispersal – they germinate to form new plants under favourable moisture and temperature conditions. They do so by reducing their metabolic activity and going into a date of ‘dormancy’.<\/li>\r\n\t<li>In animals, the organism, if unable to migrate, might avoid the stress by escaping in time. The familiar case of bears going into&nbsp;<strong>hibernation<\/strong>&nbsp;during winter is an example of escape in time.<\/li>\r\n\t<li>Some snails and fish go into&nbsp;<strong>aestivation&nbsp;<\/strong>to avoid summer-related problems-heat and desiccation.<\/li>\r\n\t<li>Under unfavorable conditions many zooplankton species in lakes and ponds are known to enter&nbsp;<strong>diapause<\/strong>, a stage of suspended development.<\/li>\r\n<\/ul>\r\n\r\n<h1>Homeostasis in Ecosystem<\/h1>\r\n\r\n<ul>\r\n\t<li>Ecosystems are capable of maintaining their state of equilibrium. They can regulate their own species structure and functional processes. This capacity of ecosystem of self-regulation is known as homeostasis.<\/li>\r\n\t<li>In ecology the term applies to the tendency for a biological systems to resist changes.<\/li>\r\n\t<li>For example, in a pond ecosystem, if the population of zooplankton increased, they would consume large number of the phytoplankton and as a result food would become scarce for zooplankton as well as other small fishes.<\/li>\r\n\t<li>When the number zooplankton is reduced because of starvation, phytoplankton population start increasing. After some time the population size of zooplankton also increases and this process continues at all the trophic levels of the food chain.<\/li>\r\n<\/ul>\r\n\r\n<ul>\r\n\t<li>Note that in a homeostatic system, negative feedback mechanism [here its scarcity of food] is responsible for maintaining stability in an ecosystem.<\/li>\r\n\t<li>However, homeostatic capacity of ecosystems is not unlimited as well as not everything in an ecosystem is always well regulated. Humans are the greatest source of disturbance to ecosystems.<\/li>\r\n<\/ul>\r\n",
            "format": "rich_text",
            "processed": "<p>Functions Of Ecosystem<\/p>\n<ul><li>The function of an ecosystem include<\/li>\n<\/ul><ol><li><strong>Ecological succession or ecosystem development<\/strong><\/li>\n<li><strong>Homeostasis (or cybernetic) or feedback control mechanisms<\/strong><\/li>\n<li><strong>Energy flow through food chain [Next Post]<\/strong><\/li>\n<li><strong>Nutrient cycling (biogeochemical cycles) [Later Post]<\/strong><\/li>\n<\/ol><p>Each will be discussed in detail in subsequent posts.<\/p>\n<p>Ecological Succession<\/p>\n<ul><li>Biotic communities are dynamic in nature and change over a period of time. The process by which communities of plant and animal species in an area are replaced or changed into another over a period of time is known as ecological succession.<\/li>\n<li>Succession is a universal process of directional change in vegetation, on an ecological time scale.<\/li>\n<li>Succession occurs when a series of communities replace one another due to large scale destruction (natural or manmade). This process continues with one community replacing another, until a stable, mature community develops.<\/li>\n<li>Succession is a progressive series of changes which leads to the establishment of a relatively <strong>stable climax community<\/strong>.<\/li>\n<\/ul><ul><li>The first plant to colonize an area is called the <strong>pioneer community<\/strong>. The final stage of succession is called the <strong>climax community<\/strong>. The stage leading to the climax community are called <strong>successional stages <\/strong>or<strong> seres<\/strong>. Each transitional (temporary) community that is formed and replaced during succession is called a stage in succession or a <strong>seral community<\/strong>.<\/li>\n<li>Succession is characterized by the following: <em>increased productivity, the shift of nutrients from’ the reservoirs, increased diversity of organisms with increased niche development, and a gradual increase in the complexity of food webs<\/em>.<\/li>\n<li>Succession would occur faster in area existing in the <strong>middle of the large continent<\/strong>. This is because, here seeds of plants belonging to the different seres would reach much faster, establish and ultimately result in climax community.<\/li>\n<li>The terminal (final) stage of succession forms the community which is called as <strong>climax community<\/strong>. A climax community is stable, mature, more complex and long lasting.<\/li>\n<li>The entire sequence of communities in a given area, succeeding each other, during the course of succession is termed <strong>sere<\/strong>. Succession that occurs on land where moisture content is low for e.g. on bare rock is known as <strong>xerarch<\/strong>. Succession that takes place in a water body, like ponds or lake is called <strong>hydrarch<\/strong>.<\/li>\n<\/ul><p>Primary Succession<\/p>\n<ul><li>Primary succession takes place an over a <strong>bare or unoccupied areas<\/strong> such as rocks outcrop, newly formed <em>deltas and sand dunes, emerging volcano islands and lava flows as well as glacial moraines<\/em> (muddy area exposed by a retreating glacier) where no community has existed previously.<\/li>\n<li>In primary succession on a terrestrial site the new site is first colonized by a few hardy pioneer species that are often <strong>microbes, lichens and mosses<\/strong>. The pioneers over a few generations alter the habitat conditions by their growth and development.<\/li>\n<\/ul><p>Lichens, which are capable of initiating ecological succession even on a bare rock, are actually a symbiotic association of <strong>algae and fungi.<\/strong>Fungus provides shelter, water and minerals to the algae and, in return, the alga provides food (photosynthesis).<\/p>\n<ul><li>These new conditions may be conducive to the establishment of additional organisms that may subsequently arrive at the site. The pioneers through their death any decay leave patches of organic matter in which small animals can live.<\/li>\n<li>The organic matter produced by these pioneer species produce organic acids during decomposition that dissolve and etch the substratum releasing nutrients to the substratum. Organic debris accumulates in pockets and crevices, providing soil in which seeds can become lodged and grow.<\/li>\n<li>As the community of organisms continues to develop, it becomes more diverse and competition increases, but at the same time new niche opportunities develops.<\/li>\n<li>The pioneer species disappear as the habitat conditions change and invasion of new species progresses, leading to the replacement of the preceding community.<\/li>\n<\/ul><p>Secondary Succession<\/p>\n<ul><li>Secondary succession occurs when plants recognize an area in which the climax community has been disturbed.<\/li>\n<li>Secondary succession is the sequential development of biotic communities after the <strong>complete or partial destruction of the existing community<\/strong>.<\/li>\n<\/ul><ul><li>A mature or intermediate community may be destroyed by natural events such as floods, droughts, fires, or storms or by human interventions such as deforestation, agriculture, overgrazing, etc.<\/li>\n<li>This abandoned farmland is first invaded by hardy species of grasses that can survive in bare, sunbaked soil. These grasses may be soon joined by tall grasses and herbaceous plants. These dominate the ecosystem for some years along with mice, rabbits, insects and seed-eating birds.<\/li>\n<li>Eventually, some trees come up in this area, seeds of which may be brought by wind or animals. And over the years, a forest community develops. Thus an abandoned farmland over a period becomes dominated by trees and is transformed into a forest.<\/li>\n<\/ul><p>Difference Between Primary and Secondary Succession<\/p>\n<ul><li>Unlike in the primary succession, the secondary succession starts on a <strong>well-developed soil<\/strong> already formed at the site. Thus secondary succession is relatively <strong>faster<\/strong> as compared to primary succession which may often require hundreds of years.<\/li>\n<\/ul><p>Autogenic and Allogenic Succession<\/p>\n<ul><li>When succession is brought about by living inhabitants of that community itself, the process is called autogenic succession, while change brought about by outside forces is known as allogenic succession.<\/li>\n<li>Autogenic succession (caused by plants themselves) is succession driven by the biotic components of an ecosystem. In contrast, allogenic succession (caused by drought, fire, flooding etc.) is driven by the abiotic components of the ecosystem.<\/li>\n<\/ul><p>Autotrophic and Heterotrophic succession<\/p>\n<ul><li>Succession in which, initially the green plants are much greater in quantity is known as autotrophic succession; and the ones in which the heterotrophs are greater in quantity is known as heterotrophic succession.<\/li>\n<\/ul><p>Succession in Plants<\/p>\n<ul><li>Based on the nature of the habitat – whether it is water (or very wet areas) or it is on very dry areas – succession of plants is called <strong>hydrach or xerarch<\/strong>, respectively.<\/li>\n<li>Hydrarch succession takes place in wetter areas and the successional series progress from hydric to the mesic (intermediate) conditions.<\/li>\n<li>As against this, xerarch succession takes place in dry areas and the series progress from xeric to mesic conditions.<\/li>\n<li>Hence, both hydrarch and xerach successions lead to <strong>medium water conditions (mesic)<\/strong> – neither too dry (xeric) nor too wet (hydric). With time the xerophytic habitat gets converted into a <strong>Mesophytic one<\/strong>.<\/li>\n<\/ul><p> <\/p>\n<p>Succession in Water<\/p>\n<ul><li>In primary succession in water, the pioneers are the small phytoplanktons, they are replaced with time by free-floating angiosperms, then by rooted hydrophytes, sedges, grasses and finally the trees. The climax again would be a forest. With time the water body is converted into land.<\/li>\n<li>Another important fact is to understand that all succession whether taking place in water or on land, proceeds to a similar climax community – the <strong>mesic<\/strong>.<\/li>\n<\/ul><p> <\/p>\n<p>Homeostasis<\/p>\n<ul><li>Homeostasis is the maintenance of a <strong>stable equilibrium<\/strong>, especially through physiological (through bodily part functions. E.g. Cooling your body through sweating) processes.<\/li>\n<li>Organisms try to maintain the constancy of its internal environment (a process called homeostasis) despite varying external environmental conditions that tend to upset its homeostasis.<\/li>\n<li>For humans, it could be achieved at home by using an air conditioner in summer and heater in winter.<\/li>\n<li>Here the person’s homeostasis is accomplished, not through physiological, but artificial means. How do other living organisms cope with the situation?<\/li>\n<\/ul><p>Regulate<\/p>\n<ul><li>Some organisms are able to maintain homeostasis by physiological (sometimes behavioral – migrating to tree shade) means which ensures constant body temperature, constant osmotic concentration, etc.<\/li>\n<li>All birds and mammals, and a very few lower vertebrate and invertebrate species are indeed capable of such regulation (thermoregulation and osmoregulation).<\/li>\n<li>The ‘success’ of mammals is largely due to their ability to maintain a constant body temperature and thrive whether they live in Antarctica or in the Sahara desert.<\/li>\n<li>The mechanisms used by most mammals to regulate their body temperature are similar to the ones that we humans use. We maintain a constant body temperature of 37 °C<\/li>\n<li>In summer, when outside temperature is more than our body temperature, we sweat profusely. The resulting evaporative cooling brings down the body temperature. In winter when the temperature is much lower than 37 °C, we start to shiver, a kind of exercise which produces heat and raises the body temperature.<\/li>\n<li>Plants, on the other hand, do not have such mechanisms to maintain internal temperatures.<\/li>\n<\/ul><p>Conform<\/p>\n<ul><li>An overwhelming majority (99 per cent) of animals and nearly all plants cannot maintain a constant internal environment. Their body temperature changes with the ambient temperature.<\/li>\n<li>In aquatic animals, the osmotic concentration of the body fluids change with that of the ambient water osmotic concentration. These animals and plants are simply <strong>conformers<\/strong>.<\/li>\n<li>Considering the benefits of a constant internal environment to the organism, we must ask why these conformers had not evolved to become regulators.<\/li>\n<li>Thermoregulation is energetically expensive for many organisms. This is particularly true for small animals like shrews and humming birds.<\/li>\n<li>Heat loss or heat gain is a function of surface area. Since small animals have a larger surface area relative to their volume, they tend to lose body heat very fast when it is cold outside; then they have to expend much energy to generate body heat [lot of food goes into heat generation] through metabolism. This is the main reason why very small animals are rarely found in polar regions.<\/li>\n<li>During the course of evolution, the costs and benefits of maintaining a constant internal environment are taken into consideration.<\/li>\n<li>Some species have evolved the ability to regulate, but only over a limited range of environmental conditions, beyond which they simply conform.<\/li>\n<li>If the stressful external conditions are localised or remain only for a short duration, the organism has two other alternatives.<\/li>\n<\/ul><p>Migrate<\/p>\n<ul><li>The organism can move away temporarily from the stressful habitat to a more hospitable area and return when stressful period is over<\/li>\n<li>Every winter the famous Keolado National Park (Bhartpur) in Rajasthan host thousands of migratory birds coming from Siberia and other extremely cold northern regions.<\/li>\n<\/ul><p>Suspend<\/p>\n<ul><li>In bacteria, fungi and lower plants, various kinds of thick-walled spores are formed which help them to survive unfavorable conditions – these germinate on availability of suitable environment.<\/li>\n<li>In higher plants, seeds and some other vegetative reproductive structures serve as means to tide over periods of stress besides helping in dispersal – they germinate to form new plants under favourable moisture and temperature conditions. They do so by reducing their metabolic activity and going into a date of ‘dormancy’.<\/li>\n<li>In animals, the organism, if unable to migrate, might avoid the stress by escaping in time. The familiar case of bears going into <strong>hibernation<\/strong> during winter is an example of escape in time.<\/li>\n<li>Some snails and fish go into <strong>aestivation <\/strong>to avoid summer-related problems-heat and desiccation.<\/li>\n<li>Under unfavorable conditions many zooplankton species in lakes and ponds are known to enter <strong>diapause<\/strong>, a stage of suspended development.<\/li>\n<\/ul><p>Homeostasis in Ecosystem<\/p>\n<ul><li>Ecosystems are capable of maintaining their state of equilibrium. They can regulate their own species structure and functional processes. This capacity of ecosystem of self-regulation is known as homeostasis.<\/li>\n<li>In ecology the term applies to the tendency for a biological systems to resist changes.<\/li>\n<li>For example, in a pond ecosystem, if the population of zooplankton increased, they would consume large number of the phytoplankton and as a result food would become scarce for zooplankton as well as other small fishes.<\/li>\n<li>When the number zooplankton is reduced because of starvation, phytoplankton population start increasing. After some time the population size of zooplankton also increases and this process continues at all the trophic levels of the food chain.<\/li>\n<\/ul><ul><li>Note that in a homeostatic system, negative feedback mechanism [here its scarcity of food] is responsible for maintaining stability in an ecosystem.<\/li>\n<li>However, homeostatic capacity of ecosystems is not unlimited as well as not everything in an ecosystem is always well regulated. Humans are the greatest source of disturbance to ecosystems.<\/li>\n<\/ul>",
            "summary": ""
        }
    ],
    "field_comment_node_page": [
        {
            "status": 1,
            "cid": 0,
            "last_comment_timestamp": 1543931886,
            "last_comment_name": null,
            "last_comment_uid": 1,
            "comment_count": 0,
            "lang": "und"
        }
    ]
}
